## Plan Result (1037: production - TerraformPlanApply)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to import, 1 to add, 1 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.juror_bau_reader
* Update
  * module.storage.azurerm_storage_account.storage_account
* Delete
  * module.storage.time_rotating.rotate
  * module.storage.time_static.pim_expiry
* Import
  * azurerm_key_vault_access_policy.bootstrap_principal
  * azurerm_key_vault_access_policy.current_principal
  * azurerm_key_vault_access_policy.platform_operations




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_access_policy.bootstrap_principal will be imported
    resource "azurerm_key_vault_access_policy" "bootstrap_principal" {
        application_id          = null
        certificate_permissions = []
        id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/baubais-data-factory-rg-prod/providers/Microsoft.KeyVault/vaults/baubais-prod-kv/objectId/0ad7e647-a69f-4602-801e-c376779334c2"
        key_permissions         = []
        key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/baubais-data-factory-rg-prod/providers/Microsoft.KeyVault/vaults/baubais-prod-kv"
        object_id               = "0ad7e647-a69f-4602-801e-c376779334c2"
        secret_permissions      = [
            "Get",
            "List",
            "Set",
            "Delete",
            "Purge",
        ]
        storage_permissions     = []
        tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_key_vault_access_policy.current_principal will be imported
    resource "azurerm_key_vault_access_policy" "current_principal" {
        application_id          = null
        certificate_permissions = []
        id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/baubais-data-factory-rg-prod/providers/Microsoft.KeyVault/vaults/baubais-prod-kv/objectId/ffc3a97e-f4fc-4866-a98a-8ba04923b0a8"
        key_permissions         = []
        key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/baubais-data-factory-rg-prod/providers/Microsoft.KeyVault/vaults/baubais-prod-kv"
        object_id               = "ffc3a97e-f4fc-4866-a98a-8ba04923b0a8"
        secret_permissions      = [
            "Get",
            "List",
            "Set",
            "Delete",
            "Purge",
        ]
        storage_permissions     = []
        tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_key_vault_access_policy.platform_operations will be imported
    resource "azurerm_key_vault_access_policy" "platform_operations" {
        application_id          = null
        certificate_permissions = [
            "Get",
            "List",
            "Update",
            "Create",
            "Import",
            "Delete",
            "Recover",
            "Backup",
            "Restore",
            "ManageContacts",
            "ManageIssuers",
            "GetIssuers",
            "ListIssuers",
            "SetIssuers",
            "DeleteIssuers",
        ]
        id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/baubais-data-factory-rg-prod/providers/Microsoft.KeyVault/vaults/baubais-prod-kv/objectId/e7ea2042-4ced-45dd-8ae3-e051c6551789"
        key_permissions         = [
            "Get",
            "List",
            "Update",
            "Create",
            "Import",
            "Delete",
            "Recover",
            "Backup",
            "Restore",
            "GetRotationPolicy",
            "SetRotationPolicy",
            "Rotate",
        ]
        key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/baubais-data-factory-rg-prod/providers/Microsoft.KeyVault/vaults/baubais-prod-kv"
        object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
        secret_permissions      = [
            "Get",
            "List",
            "Set",
            "Delete",
            "Purge",
        ]
        storage_permissions     = []
        tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_role_assignment.juror_bau_reader will be created
  + resource "azurerm_role_assignment" "juror_bau_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6f9ae14c-5d96-40f2-934e-cfe21fc5a054"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/juror-prod-rg/providers/Microsoft.Storage/storageAccounts/jurorsaprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/baubais-data-factory-rg-prod/providers/Microsoft.Storage/storageAccounts/synapsebaubaisprod"
        name                               = "synapsebaubaisprod"
        tags                               = {
            "application"  = "baubais"
            "builtFrom"    = "hmcts/juror-er-infra"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.storage.time_rotating.rotate will be destroyed
  # (because time_rotating.rotate is not in configuration)
  - resource "time_rotating" "rotate" {
      - day              = 20 -> null
      - hour             = 10 -> null
      - id               = "2025-04-25T10:10:05Z" -> null
      - minute           = 10 -> null
      - month            = 4 -> null
      - rfc3339          = "2025-04-25T10:10:05Z" -> null
      - rotation_days    = 360 -> null
      - rotation_rfc3339 = "2026-04-20T10:10:05Z" -> null
      - second           = 5 -> null
      - unix             = 1776679805 -> null
      - year             = 2026 -> null
    }

  # module.storage.time_static.pim_expiry will be destroyed
  # (because time_static.pim_expiry is not in configuration)
  - resource "time_static" "pim_expiry" {
      - day     = 20 -> null
      - hour    = 10 -> null
      - id      = "2026-04-20T10:10:05Z" -> null
      - minute  = 10 -> null
      - month   = 4 -> null
      - rfc3339 = "2026-04-20T10:10:05Z" -> null
      - second  = 5 -> null
      - unix    = 1776679805 -> null
      - year    = 2026 -> null
    }

Plan: 3 to import, 1 to add, 1 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":42,"Program":"tfcmt","SHA1":"","Target":"1037: production - TerraformPlanApply","Vars":{}} -->